'''
Python列表脚本操作符
Python 表达式	                        结果	                         描述
len([1, 2, 3])	                        3	                            长度
[1, 2, 3] + [4, 5, 6]	                [1, 2, 3, 4, 5, 6]	            组合
['Hi!'] * 4	                            ['Hi!', 'Hi!', 'Hi!', 'Hi!']	重复
3 in [1, 2, 3]	                        True	                        元素是否存在于列表中
for x in [1, 2, 3]: print(x, end=" ")	1 2 3	                        迭代
'''

'''
Python列表截取与拼接
Python的列表截取与字符串操作类似
'''

'''
嵌套列表
使用嵌套列表即在列表里创建其它列表

如果有其他语言的基础，会发现嵌套列表的使用和数据结构和多维数组很像。实际上，python的列表可以当做其他语言的数组使用！
'''